In [1]:
import pandas as pd

In [2]:
scientists = pd.read_csv('data/scientists.csv')

In [3]:
scientists

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [9]:
scientists.dtypes

Name                  object
Born          datetime64[ns]
Died          datetime64[ns]
Age                    int64
Occupation            object
dtype: object

In [5]:
born = pd.to_datetime(scientists['Born'], format='%Y-%m-%d')
born

0   1920-07-25
1   1876-06-13
2   1820-05-12
3   1867-11-07
4   1907-05-27
5   1813-03-15
6   1912-06-23
7   1777-04-30
Name: Born, dtype: datetime64[ns]

In [7]:
die = pd.to_datetime(scientists['Died'],format='%Y-%m-%d')
die

0   1958-04-16
1   1937-10-16
2   1910-08-13
3   1934-07-04
4   1964-04-14
5   1858-06-16
6   1954-06-07
7   1855-02-23
Name: Died, dtype: datetime64[ns]

In [8]:
scientists['Born'],scientists['Died'] = (born,die)

In [12]:
scientists['Live_day'] = (scientists['Died']-scientists['Born'])

In [13]:
scientists

,Name,Born,Died,Age,Occupation,Live_day
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,13779 days
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,32964 days
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,20777 days
5,John Snow,1813-03-15,1858-06-16,45,Physician,16529 days
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,28422 days

In [23]:
scientists2 = scientists.drop(['Born'], axis=1)
scientists2

                   Name       Died  Age          Occupation   Live_day
0     Rosaline Franklin 1958-04-16   37             Chemist 13779 days
1        William Gosset 1937-10-16   61        Statistician 22404 days
2  Florence Nightingale 1910-08-13   90               Nurse 32964 days
3           Marie Curie 1934-07-04   66             Chemist 24345 days
4         Rachel Carson 1964-04-14   56           Biologist 20777 days
5             John Snow 1858-06-16   45           Physician 16529 days
6           Alan Turing 1954-06-07   41  Computer Scientist 15324 days
7          Johann Gauss 1855-02-23   77       Mathematician 28422 days

In [24]:
scientists2 = scientists2.drop([2,6], axis=0)
scientists2

                Name       Died  Age     Occupation   Live_day
0  Rosaline Franklin 1958-04-16   37        Chemist 13779 days
1     William Gosset 1937-10-16   61   Statistician 22404 days
3        Marie Curie 1934-07-04   66        Chemist 24345 days
4      Rachel Carson 1964-04-14   56      Biologist 20777 days
5          John Snow 1858-06-16   45      Physician 16529 days
7       Johann Gauss 1855-02-23   77  Mathematician 28422 days

In [32]:
add_sci = ['aaa','2020-01-01',100,'aaa','5000 days']
add_sci

['aaa', '2020-01-01', 100, 'aaa', '5000 days']

In [33]:
scientists2.loc[8] = add_sci

In [34]:
scientists2

,Name,Died,Age,Occupation,Live_day
0,Rosaline Franklin,1958-04-16 00:00:00,37,Chemist,13779 days 00:00:00
1,William Gosset,1937-10-16 00:00:00,61,Statistician,22404 days 00:00:00
3,Marie Curie,1934-07-04 00:00:00,66,Chemist,24345 days 00:00:00
4,Rachel Carson,1964-04-14 00:00:00,56,Biologist,20777 days 00:00:00
5,John Snow,1858-06-16 00:00:00,45,Physician,16529 days 00:00:00
7,Johann Gauss,1855-02-23 00:00:00,77,Mathematician,28422 days 00:00:00
8,aaa,2020-01-01,100,aaa,5000 days

In [35]:
scientists2.dtypes

Name          object
Died          object
Age            int64
Occupation    object
Live_day      object
dtype: object